var types = [];

var breadType =[`בגט`,`בייגל`,`בריוש`,`וופל בלגי`,`לאפה`,`לחם איטלקי`,`לחמניה`,`לחמניה (ללא גלוטן)`,`לחמניית תפו"א`,`מצה`,`מצה שמורה`,`פיתה`,`פיתה מקמח קוסמין`,`פרוסת לחם לבן`,`פרוסת לחם שחור`,`קרקר`];

var mainType = [`אוסף להיטים כפול: שרית חדד - המיטב`,`אנשובי`,`בייקון`,`ביצה קשה`,`ביצת עין`,`גאודה`,`גבינה בולגרית`,`גבינה צהובה`,`דגל ישראל`,`החיים עצמם`,`חזה עוף`,`טונה`,`טופו`,`כבד אווז`,`כוכב-ים ורוד`,`כנאפה`,`כנפ"צ`,`כפכף (ימין)`,`כפכף (שמאל)`,`כרית פוקים`,`לוף`,`לשון`,`מטען לאייפון`,`ממרח דגים`,`מנת חיסון לקורונה`,`מעורב ירושלמי`,`נקניקיה`,`סייטן`,`סלאמי`,`ספוג צהוב`,`סרדינים`,`פטה כבד`,`פטריית פורטבלו`,`פלאפל`,`פלאפל`,`פסטרמה`,`פרגיות`,`קבב`,`קופונים`,`קציצת בורגר (וול דאן)`,`קציצת בורגר (מדיום)`,`קציצת בורגר (רייר)`,`קרוקס`,`רב-קו`,`רוסטביף`,`שווארמה`,`שייק בריאות`,`שניצל`,`שקשוקה`];
types.push(mainType);
var vegType = [`אלף האיים`,`ברביקיו`,`חומוס`,`חמאת בוטנים`,`חמאת שקדים`,`חרדל`,`חרדל דיז'ון`,`טחינה`,`טריאקי`,`כורכום`,`כמון`,`מיונז`,`מייפל`,`מלח ופלפל`,`סויה`,`סוכרזית`,`סחוג אדום`,`סחוג ירוק`,`סירופ שוקולד`,`עמבה`,`פפריקה חריפה`,`פפריקה מתוקה`,`צ'ילי`,`קטשופ`,`קצפת`,`רוטב ברבקיו`,`רוטב שום`,`רסק עגבניות`];
types.push(vegType);
var sauceType = [`חומוס`,`חמאת בוטנים`,`חמאת שקדים`,`חרדל`,`חרדל דיז'ון`,`טחינה`,`טחינה גולמית`,`כורכום`,`כמון`,`לבאנה`,`מיונז`,`מלח פלפל`,`מרק לקוסקוס`,`נגיעה שמן זית`,`סוכרזית אחד`,`סחוג אדום`,`סחוג ירוק`,`סירופ מייפל`,`סירופ שוקולד`,`ערק איילים`,`פפריקה חריפה`,`פפריקה מתוקה`,`קוטג'`,`קטשופ`,`קצפת`,`רוטב אלף האיים`,`רוטב באפלו`,`רוטב ברביקיו`,`רוטב ברבקיו`,`רוטב ווסטשייר`,`רוטב חריף`,`רוטב טריאקי`,`רוטב סויה`,`רוטב עמבה`,`רוטב פסטו אדום`,`רוטב צ'ילי חריף`,`רוטב צ'ילי מתוק`,`רוטב שום`,`רסק עגבניות`,`שוקולד השחר`,`שניים סוכרזית`,`שניים סוכרזית`,`שפריץ מיץ לימון`];
types.push(sauceType);

var specialServe = [`[אינסייד-אאוט]`,`[אפ-סייד-דאון]`,`[מטובען 🌱]`,`[על מצע חסה]`,`[על מצע פירה]`,`[עם דגל הגאווה מעל]`,`[עם דגל ישראל מעל]`,`[עם דגל משיח מעל]`,`[שלושה, אבל ממש קטנים]`];