var types = [];

var breadType = [`פרוסת לחם לבן`,`פרוסת לחם שחור`,`בייגל`,`לחמניה`,`פיתה`,`לחמניה (ללא גלוטן)`,`קרקר`];

var mainType = [`פלאפל`,`נקניקיה`,`נקניק`,`קציצה`,`קבב`,`שווארמה`,`גבינה צהובה`,`גבינה בולגרית`,`טונה`,`שניצל`,`טופו`,`סייטן`,`לשון`];
types.push(mainType);
var vegType = [`עגבניה`,`מלפפון`,`חסה`,`בצל סגול`,`בצל לבן`,`כרוב כבוש`,`חמוצים במלח`,`חמוצים בחומץ`,`שעועית שחורה`,`גזר`,`פירות העונה`,`בוטנים מרוסקים`,`כרוב`,`כרוב אדום`,`קרוטונים`,`קוויאר`,`בזיליקום`,`נענע`,`סלט עלים`,`תמרים`,`בננה`,`דובדבנים`,`ג'לי`,`פלפל אדום`,`פלפל כתום`,`פלפל ירוק`,`פלפל חריף`];
types.push(vegType);
var sauceType = [`מיונז`,`קטשופ`,`טחינה`,`עמבה`,`סחוג אדום`,`סחוג ירוק`,`אלף האיים`,`חרדל`,`חרדל דיז'ון`,`צ'ילי`,`ברביקיו`,`סויה`,`רוטב שום`,`חומוס`];
types.push(sauceType);

var specialServe = [`[מטובען]`,`[מוגש על מצע של חסה]`];