var types = [];

var breadType =[`בגט`,`בייגל`,`חצי בגט`,`לאפה`,`לחמניה`,`לחמניה (ללא גלוטן)`,`מצה`,`מצה שמורה`,`פיתה`,`פיתה מקמח קוסמין`,`פרוסת לחם לבן`,`פרוסת לחם שחור`,`קרקר`,`וופל בלגי`];

var mainType = [`פלאפל`,`נקניקיה`,`נקניק`,`קציצה`,`קבב`,`שווארמה`,`גבינה צהובה`,`גבינה בולגרית`,`טונה`,`שניצל`,`טופו`,`סייטן`,`לשון`,`שקשוקה`,`כנאפה`,`שייק בריאות`];
types.push(mainType);
var vegType = [`אלף האיים`,`ברביקיו`,`חומוס`,`חמאת בוטנים`,`חמאת שקדים`,`חרדל`,`חרדל דיז'ון`,`טחינה`,`טריאקי`,`כורכום`,`כמון`,`מיונז`,`מייפל`,`מלח ופלפל`,`סויה`,`סוכרזית`,`סחוג אדום`,`סחוג ירוק`,`סירופ שוקולד`,`עמבה`,`פפריקה חריפה`,`פפריקה מתוקה`,`צ'ילי`,`קטשופ`,`קצפת`,`רוטב ברבקיו`,`רוטב שום`,`רסק עגבניות`];
types.push(vegType);
var sauceType = [`מיונז`,`קטשופ`,`טחינה`,`עמבה`,`סחוג אדום`,`סחוג ירוק`,`אלף האיים`,`חרדל`,`חרדל דיז'ון`,`צ'ילי`,`ברביקיו`,`סויה`,`רוטב שום`,`חומוס`,`רסק עגבניות`,`קצפת`,`מייפל`,`סירופ שוקולד`,`סוכרזית`,`כורכום`,`פפריקה חריפה`,`פפריקה מתוקה`,`כמון`,`מלח ופלפל`,`רוטב ברבקיו`,`טריאקי`];
types.push(sauceType);

var specialServe = [`[מטובען]`,`[על מצע חסה]`,`[עם דגל ישראל מעל]`,`[עם דגל הגאווה מעל]`,`[עם דגל משיח מעל]`,`[שלושה, אבל ממש קטנים]`,`[על מצע פירה]`];