var types = [];

var breadType =[`פרוסת לחם לבן`,`פרוסת לחם שחור`,`בייגל`,`לחמניה`,`פיתה`,`לחמניה (ללא גלוטן)`,`קרקר`,`מצה`,`מצה שמורה`];

var mainType = [`פלאפל`,`נקניקיה`,`נקניק`,`קציצה`,`קבב`,`שווארמה`,`גבינה צהובה`,`גבינה בולגרית`,`טונה`,`שניצל`,`טופו`,`סייטן`,`לשון`,`שקשוקה`,`כנאפה`,`שייק בריאות`];
types.push(mainType);
var vegType = [`עגבניה`,`פרוסת מלפפון`,`חסה`,`בצל סגול`,`בצל לבן`,`כרוב כבוש`,`חמוצים במלח`,`חמוצים בחומץ`,`שערות סבתא`,`גזר`,`פירות העונה`,`בוטנים מרוסקים`,`כרוב`,`כרוב אדום`,`קרוטונים`,`קוויאר`,`בזיליקום`,`נענע`,`סלט עלים`,`תמרים`,`בננה`,`דובדבנים`,`ג'לי`,`פלפל אדום`,`פלפל כתום`,`פלפל ירוק`,`פלפל חריף`,`פרוסת מלפלפון`,`גזר שלם (לא מקולף)`,`ג'חנון`,`שן שום`,`סוכרזית`,`שוקולית`,`פופקורן`,`פרחי לילך`,`קולורבי`,`כרוב ניצנים`,`נבטים`,`זרעי פשתן`,`קבוקים`,`פלחי תפוז`,`פלחי אשכולית`,`פלחי קלמנטינה`,`פלחי לימון`,`פלחי תפוז סיני`,`אננס`,`גרעינים שחורים`,`שעועית ירוקה`,`שעועית לבנה`,`שעועית שחורה`];
types.push(vegType);
var sauceType = [`מיונז`,`קטשופ`,`טחינה`,`עמבה`,`סחוג אדום`,`סחוג ירוק`,`אלף האיים`,`חרדל`,`חרדל דיז'ון`,`צ'ילי`,`ברביקיו`,`סויה`,`רוטב שום`,`חומוס`,`רסק עגבניות`,`קצפת`,`מייפל`,`סירופ שוקולד`,`סוכרזית`,`כורכום`,`פפריקה חריפה`,`פפריקה מתוקה`,`כמון`,`מלח ופלפל`,`רוטב ברבקיו`,`טריאקי`];
types.push(sauceType);

var specialServe = [`[מטובען]`,`[על מצע חסה]`,`[עם דגל ישראל מעל]`,`[עם דגל הגאווה מעל]`,`[עם דגל משיח מעל]`,`[שלושה, אבל ממש קטנים]`,`[על מצע פירה]`];